#-*- coding: utf-8 -*-
"""
Файл __init__ используется как модуль для подготовки данных
"""
__all__ = ['pz','pl','lz_gaz','lz_tr_neft','ll_gaz','ll_tr_neft','lnn_1_9','lnn_2_0','lnn_1_7','bpi_1_7', 'bpi_2_0','LENTA_NAME', 'PATH', 'NAME_INPUT'] # присвоение списка строк с именами доступными для импортирования

PATH = [r'DATA_CSV/П_З.csv',r'DATA_CSV/П_Л.csv',r'DATA_CSV/ЛИТ_З_газ.csv',r'DATA_CSV/ЛИТ_З_тр_нефть.csv',r'DATA_CSV/ЛИТ_Л_газ.csv',r'DATA_CSV/ЛИТ_Л_тр_нефть.csv', r'DATA_CSV/ЛИТ_НН_1_9.csv', r'DATA_CSV/ЛИТ_НН_2_0.csv', r'DATA_CSV/ЛИТ_НН_1_7.csv', r'DATA_CSV/БПИ_1_7.csv', r'DATA_CSV/БПИ_2_0.csv',]

_pz,_pl,_lz_gaz,_lz_tr_neft,_ll_gaz,_ll_tr_neft,_lnn_1_9,_lnn_2_0,_lnn_1_7,_bpi_1_7, _bpi_2_0, *_ = PATH # распределение последовательности по переменным

LENTA_NAME = ['ПИРМА-З','ПИРМА-Л','ЛИТКОР-З_газ','ЛИТКОР-З_тр_нефть','ЛИТКОР-Л_газ', 'ЛИТКОР-Л_тр_нефть', 'ЛИТКОР-НН толщина 1.9 мм.',  'ЛИТКОР-НН толщина 2.0 мм.', 'ЛИТКОР-НН толщина 1.7 мм.','БПИ толщина 1.7 мм.','БПИ толщина 2.0 мм',*_] # запись наименований

NAME_INPUT = {'001':_pz,'002':_pl,'003':_lz_gaz,'004':_lz_tr_neft,'005':_ll_gaz,'006':_ll_tr_neft,'007':_lnn_1_9,'008':_lnn_2_0,'009':_lnn_1_7,'010':_bpi_1_7, '011':_bpi_2_0,}